; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v2 - type_3 ?v5 - type_2)
 	      (pred_2 ?v8 - object ?v5 - type_2)
	      (pred_4 ?v2 - type_3 ?v7 - type_1)
	      (pred_1 ?v2 - type_3 ?v8 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v2 - type_3 ?v3 ?v4 - type_2)
       :precondition (and  (pred_3 ?v2 ?v3))
       :effect (and  (pred_3 ?v2 ?v4)
		     (not (pred_3 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_3 ?v1 - object ?v6 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v6) (pred_3 ?v2 ?v6) (pred_4 ?v2 ?v7))
       :effect (and (pred_1 ?v2 ?v1 ?v7)
		    (not (pred_2 ?v1 ?v6)) 
		    (not (pred_4 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_3 ?v1 - object ?v6 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v1 ?v7) (pred_3 ?v2 ?v6))
       :effect (and (pred_2 ?v1 ?v6)
		    (pred_4 ?v2 ?v7)
		    (not (pred_1 ?v2 ?v1 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_12 - type_3
obj_10 obj_01 obj_02 obj_05 - type_1
obj_03 obj_09 obj_08 obj_11 - type_2
obj_04 obj_13 obj_07 - object)
(:init
(pred_3 obj_06 obj_03)
(pred_4 obj_06 obj_10)
(pred_4 obj_06 obj_01)
(pred_3 obj_12 obj_11)
(pred_4 obj_12 obj_02)
(pred_4 obj_12 obj_05)
(pred_2 obj_04 obj_03)
(pred_2 obj_13 obj_08)
(pred_2 obj_07 obj_11)
)
(:goal
(and
(pred_2 obj_04 obj_08)
(pred_2 obj_13 obj_11)
(pred_2 obj_07 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_06 obj_08)))
)
)

; plan
1. (op_3 obj_06 obj_04 obj_03 obj_01)
   deleted: (pred_2 obj_04 obj_03) (pred_4 obj_06 obj_01)
   added: (pred_1 obj_06 obj_04 obj_01)
   goals met: 1 of 3
2. (op_2 obj_12 obj_11 obj_08)
   deleted: (pred_3 obj_12 obj_11)
   added: (pred_3 obj_12 obj_08)
   goals met: 1 of 3
3. (op_3 obj_12 obj_13 obj_08 obj_05)
   deleted: (pred_2 obj_13 obj_08) (pred_4 obj_12 obj_05)
   added: (pred_1 obj_12 obj_13 obj_05)
   goals met: 1 of 3
4. (op_2 obj_06 obj_03 obj_11)
   deleted: (pred_3 obj_06 obj_03)
   added: (pred_3 obj_06 obj_11)
   goals met: 1 of 3
5. (op_2 obj_12 obj_08 obj_11)
   deleted: (pred_3 obj_12 obj_08)
   added: (pred_3 obj_12 obj_11)
   goals met: 1 of 3
6. (op_1 obj_06 obj_04 obj_11 obj_01)
   deleted: (pred_1 obj_06 obj_04 obj_01)
   added: (pred_2 obj_04 obj_11) (pred_4 obj_06 obj_01)
   goals met: 1 of 3
7. (op_1 obj_12 obj_13 obj_11 obj_05)
   deleted: (pred_1 obj_12 obj_13 obj_05)
   added: (pred_2 obj_13 obj_11) (pred_4 obj_12 obj_05)
   goals met: 2 of 3
8. (op_3 obj_12 obj_04 obj_11 obj_05)
   deleted: (pred_2 obj_04 obj_11) (pred_4 obj_12 obj_05)
   added: (pred_1 obj_12 obj_04 obj_05)
   goals met: 2 of 3
9. (op_2 obj_12 obj_11 obj_08)
   deleted: (pred_3 obj_12 obj_11)
   added: (pred_3 obj_12 obj_08)
   goals met: 2 of 3
10. (op_1 obj_12 obj_04 obj_08 obj_05)
   deleted: (pred_1 obj_12 obj_04 obj_05)
   added: (pred_2 obj_04 obj_08) (pred_4 obj_12 obj_05)
   goals met: 3 of 3
